#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_s3_bucket.existing_bucket: Reading...
data.aws_s3_bucket.existing_bucket: Read complete after 0s [id=github-oidc-terraform-aws-tfstates-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket_policy.existing_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "existing_bucket_policy" {
      + bucket = "github-oidc-terraform-aws-tfstates-bucket"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::github-oidc-terraform-aws-tfstates-bucket/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_s3_bucket_website_configuration.existing_bucket_website will be created
  + resource "aws_s3_bucket_website_configuration" "existing_bucket_website" {
      + bucket           = "github-oidc-terraform-aws-tfstates-bucket"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # aws_s3_object.existing_bucket_files["index.html"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../frontend/Views/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["style.css"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "style.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../frontend/Views/style.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Dutchua, Action: `pull_request`*